Updates diagrams - via mermaid
